---
title: æ–‡ä»¶å­˜å‚¨
date: 2021-03-30 14:40:30
permalink: /pages/46a6b5/
categories:
  - å­¦ä¹ 
  - ceph
tags:
  - ceph
---

æœ¬æ–‡ä¸»è¦è®°å½•åŸºäºcephçš„æ–‡ä»¶ç³»ç»Ÿï¼Œä½¿ç”¨httpã€cifsã€nfsã€ftpåˆ†åˆ«åœ¨winä¸linuxä¸ŠæŒ‚è½½ä½¿ç”¨


<!-- more -->

## http

- æµè§ˆå™¨ç›´æ¥è®¿é—®

- é…ç½®http

```shell
root in summer in /etc/httpd/conf took 53s 
âœ sed -n '186,201p' /etc/httpd/conf/httpd.conf 

Listen 80
<VirtualHost *:80>
    DocumentRoot "/kr/ftp-summer-AAA"
    Alias /icons/ "/usr/share/httpd/icons/"
    TraceEnable off
    <Directory "/usr/share/httpd/icons/">
        Options FollowSymlinks
        AllowOverride None
        Require all granted
    </Directory>
    <Directory "/kr/ftp-summer-AAA">
        Options Indexes FollowSymLinks
        AllowOverride None
    </Directory>
</VirtualHost>
root in summer in /etc/httpd/conf 
âœ
```

## cifs
>ä¹Ÿå«sambaï¼Œ
1. æŸ¥çœ‹ samba-clientã€ cifs-utils åŒ…æ˜¯å¦å®‰è£…ï¼Œæ²¡æœ‰å®‰è£…çš„è¯ï¼Œéœ€è¦å®‰è£…ä¸‹ã€‚
```shell
yum install -y samba-client cifs-utils
```

2. é€šè¿‡â€œsmbclient â€“L æ–‡ä»¶å…±äº«æœåŠ¡å™¨ IPâ€ï¼Œ æŸ¥çœ‹â€œå…±äº«åç§°â€
```shell
root in summer in / 
âœ smbclient -L 192.168.163.201
Enter WORKGROUP\root's password: 

        Sharename       Type      Comment
        ---------       ----      -------
        opoo            Disk      
        IPC$            IPC       IPC Service (Samba 4.10.4)
Reconnecting with SMB1 for workgroup listing.
do_connect: Connection to 192.168.163.201 failed (Error NT_STATUS_CONNECTION_REFUSED)
Unable to connect with SMB1 -- no workgroup available
root in summer in / 
```

3. æŒ‚è½½ CIFS å…±äº«

- æŒ‚è½½æ–¹å¼ä¸ºâ€œmount â€“ t cifs //æ–‡ä»¶å…±äº« IP åœ°å€/å…±äº«ç›®å½• /æŒ‚è½½ç‚¹â€ï¼ŒåŒ¿åè®¿é—®ï¼Œä¸éœ€è¦è¾“å…¥å¯†ç â†’å›è½¦
- æŒ‚è½½æ–¹å¼ä¸ºâ€œmount -t cifs //æ–‡ä»¶å…±äº« IP åœ°å€/å…±äº«è½½ç‚¹ -o username=ç”¨æˆ·åâ€ â†’è¾“å…¥â€œæœ¬åœ°ç³»ç»Ÿç”¨æˆ·å¯†ç â€ â†’å›è½¦
```shell
âœ mount -t cifs //192.168.163.201/opoo smb/
Password for root@//192.168.163.201/opoo:  
root in summer in / 
âœ df -h
Filesystem              Size  Used Avail Use% Mounted on
devtmpfs                1.7G     0  1.7G   0% /dev
tmpfs                   1.7G   20K  1.7G   1% /dev/shm
tmpfs                   1.7G   25M  1.7G   2% /run
tmpfs                   1.7G     0  1.7G   0% /sys/fs/cgroup
/dev/mapper/os-root      93G   39G   49G  45% /
/dev/sda2               4.8G  695M  3.9G  15% /usr/summer_vfs
/dev/sda1               976M  385M  525M  43% /boot
tmpfs                   344M     0  344M   0% /run/user/1000
tmpfs                   344M     0  344M   0% /run/user/0
/dev/sdb1                30G   21G   10G  67% /var/lib/ceph/osd/ceph-0
/dev/sdc1                30G   21G   10G  67% /var/lib/ceph/osd/ceph-1
//192.168.163.201/opoo   60G     0   60G   0% /smb
root in summer in / 
âœ 

```

## nfs
```shell
root in summer in ~ via ğŸ v2.7.5 took 53s 
â¯ showmount -e 192.168.163.201
Export list for 192.168.163.201:
/kr/share *
root in summer in /mnt 
âœ mount -t nfs -o nolock 192.168.163.201:/kr/share /mnt

```

## ftp

- åŒ¿åç”¨æˆ·è®¿é—®ç”¨æˆ·åå¯†ç ï¼šanonymous
- æ— æ³•è®¿é—®çš„è¯æœ€å¥½çœ‹ä¸‹è®¾ç½®çš„ç›®å½•æƒé™

```shell
[root@summer ~]# ftp 192.168.163.200
Connected to 192.168.163.200 (192.168.163.200).
220 ProFTPD 1.3.5e Server ready.
Name (192.168.163.200:root): anonymous
331 Anonymous login ok, send your complete email address as your password
Password:
230 Anonymous access granted, restrictions apply
Remote system type is UNIX.
Using binary mode to transfer files.
ftp> 
ftp> 
ftp> ls
227 Entering Passive Mode (192,168,163,200,213,200).
150 Opening ASCII mode data connection for file list
-rw-rw-rw-   1 nobody   nobody    3703082 Mar 31 07:26 hci.pdf
-rw-rw-rw-   1 nobody   nobody       3162 Mar 31 07:26 summer.conf.yml
-rw-r--r--   1 root     root            0 Mar 31 07:18 xxx
226 Transfer complete
ftp> put 123.sh
local: 123.sh remote: 123.sh
227 Entering Passive Mode (192,168,163,200,216,167).
150 Opening BINARY mode data connection for 123.sh
226 Transfer complete
52 bytes sent in 0.00873 secs (5.96 Kbytes/sec)
ftp> ls
227 Entering Passive Mode (192,168,163,200,221,80).
150 Opening ASCII mode data connection for file list
-rw-rw-rw-   1 nobody   nobody         52 Mar 31 07:36 123.sh
226 Transfer complete
ftp> !ls
123.sh		 lsblk-2.32.1-1.el7.x86_64.rpm  soft
ftp> exit
221 Goodbye.
```

